In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = Series([0,1,2,3,4])

In [3]:
dframe

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [4]:
dframe = DataFrame(np.arange(12).reshape(3,4),index=['NY','LA','SF'],columns =['A','B','C','D'])

In [5]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [6]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [7]:
dframe.index = dframe.index.map(str.lower)

In [8]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [9]:
dframe.rename(index=str.title,columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [10]:
dframe.columns.name = 'Topics'

In [11]:
dframe

Topics  A  B   C   D
ny      0  1   2   3
la      4  5   6   7
sf      8  9  10  11

In [12]:
dframe.index.name='Cities'

In [13]:
dframe

Topics  A  B   C   D
Cities
ny      0  1   2   3
la      4  5   6   7
sf      8  9  10  11

In [14]:
dframe.index = ['hi','hello','world']

In [15]:
dframe

Topics  A  B   C   D
hi      0  1   2   3
hello   4  5   6   7
world   8  9  10  11

In [16]:
dframe.index = ['Ny','La','Sf']

In [17]:
dframe

Topics  A  B   C   D
Ny      0  1   2   3
La      4  5   6   7
Sf      8  9  10  11

In [18]:
dframe.rename(index={'Ny':'New York'})

Topics    A  B   C   D
New York  0  1   2   3
La        4  5   6   7
Sf        8  9  10  11

In [19]:
dframe

Topics  A  B   C   D
Ny      0  1   2   3
La      4  5   6   7
Sf      8  9  10  11

In [20]:
dframe.rename(index={'Ny':'New York','La':'Los Angels','Sf':'San Francisco'},inplace=True)

In [21]:
dframe

Topics         A  B   C   D
New York       0  1   2   3
Los Angels     4  5   6   7
San Francisco  8  9  10  11

In [23]:
dframe.rename(index=['sur','har','sav'])

TypeError: 'list' object is not callable